<template>
  <div class="hello">
    <el-tabs v-model="activeName" type="card">
      <el-tab-pane v-for="(card, key) in cities" :label="key" :key="key" :name="key">
        <div class="alpha" v-for="(alpha, key1) in card" :key="key1">
          <div class="alphal">{{key1}}</div>
          <div class="alphar">
            <span class="city" v-for="city in alpha" :key="city.d" @click="$emit('setCity', city.d)">{{city.d}}</span>
          </div>
        </div>
      </el-tab-pane>
    </el-tabs>
    <el-button @click="$emit('setCity', '')" style="float: right" size="mini">清空所选</el-button>
  </div>
</template>

<script>
export default {
  data () {
    return {
      activeName: '热门',
      cities: {
        '热门': {'热': [{d: '北京'}, {d: '上海'}, {d: '杭州'}, {d: '广州'}, {d: '南京'}, {d: '武汉'}, {d: '郑州'}, {d: '长沙'}, {d: '深圳'}, {d: '成都'}, {d: '西安'}, {d: '合肥'}, {d: '重庆'}, {d: '汉口'}, {d: '济南'}, {d: '天津'}, {d: '苏州'}, {d: '沈阳'}, {d: '青岛'}, {d: '厦门'}]},
        'A-D': {A: [{d: '阿克苏'}, {d: '安康'}, {d: '安陆'}, {d: '安庆'}, {d: '鞍山'}, {d: '安顺'}, {d: '安阳'}, {d: '鳌江'}], B: [{d: '白城'}, {d: '保定'}, {d: '宝鸡'}, {d: '包头'}, {d: '鲅鱼圈'}, {d: '巴中'}, {d: '北戴河'}, {d: '北海'}, {d: '北京'}, {d: '北屯市'}, {d: '蚌埠'}, {d: '博乐'}], C: [{d: '苍南'}, {d: '沧州'}, {d: '草海'}, {d: '长春'}, {d: '常德'}, {d: '长沙'}, {d: '长兴'}, {d: '长治'}, {d: '常州'}, {d: '巢湖'}, {d: '潮州'}, {d: '承德'}, {d: '成都'}, {d: '郴州'}, {d: '赤壁'}, {d: '赤峰'}, {d: '重庆'}, {d: '滁州'}], D: [{d: '大理'}, {d: '大连'}, {d: '丹东'}, {d: '丹阳'}, {d: '大庆'}, {d: '大同'}, {d: '达州'}, {d: '德令哈'}, {d: '德清'}, {d: '德阳'}, {d: '德州'}, {d: '定远'}, {d: '东莞'}, {d: '东海县'}, {d: '东胜'}, {d: '东营'}, {d: '都江堰'}, {d: '敦煌'}]},
        'E-H': {E: [{d: '额济纳'}, {d: '峨眉'}, {d: '恩施'}, {d: '鄂州'}], F: [{d: '佛山'}, {d: '福安'}, {d: '福鼎'}, {d: '涪陵'}, {d: '福清'}, {d: '抚顺'}, {d: '阜新'}, {d: '阜阳'}, {d: '福州'}, {d: '抚州'}], G: [{d: '赣州'}, {d: '高密'}, {d: '格尔木'}, {d: '广安'}, {d: '光明城'}, {d: '广通'}, {d: '广元'}, {d: '广州'}, {d: '谷城'}, {d: '桂林'}, {d: '贵阳'}, {d: '古镇'}], H: [{d: '哈尔滨'}, {d: '海安县'}, {d: '海城'}, {d: '海口'}, {d: '海拉尔'}, {d: '海宁'}, {d: '哈密'}, {d: '邯郸'}, {d: '杭州'}, {d: '涵江'}, {d: '汉口'}, {d: '汉中'}, {d: '鹤壁'}, {d: '合川'}, {d: '合肥'}, {d: '鹤岗'}, {d: '黑河'}, {d: '衡山'}, {d: '衡水'}, {d: '衡阳'}, {d: '菏泽'}, {d: '淮安'}, {d: '淮北'}, {d: '怀化'}, {d: '淮南'}, {d: '黄山'}, {d: '黄石'}, {d: '华山'}, {d: '呼和浩特'}, {d: '惠州'}, {d: '葫芦岛'}, {d: '虎门'}, {d: '湖州'}]},
        'J-M': {J: [{d: '佳木斯'}, {d: '吉安'}, {d: '江门'}, {d: '江山'}, {d: '胶州'}, {d: '嘉善'}, {d: '嘉兴'}, {d: '嘉峪关'}, {d: '揭阳'}, {d: '吉林'}, {d: '济南'}, {d: '晋城'}, {d: '景德镇'}, {d: '荆门'}, {d: '荆州'}, {d: '金华'}, {d: '集宁'}, {d: '济宁'}, {d: '晋江'}, {d: '锦州'}, {d: '吉首'}, {d: '九江'}, {d: '酒泉'}, {d: '鸡西'}], K: [{d: '开封'}, {d: '凯里'}, {d: '喀什'}, {d: '库尔勒'}, {d: '昆明'}, {d: '昆山'}], L: [{d: '廊坊'}, {d: '兰州'}, {d: '拉萨'}, {d: '耒阳'}, {d: '梁平'}, {d: '连江'}, {d: '连云港'}, {d: '聊城'}, {d: '辽阳'}, {d: '辽源'}, {d: '丽江'}, {d: '临汾'}, {d: '陵水'}, {d: '临海'}, {d: '临河'}, {d: '临沂'}, {d: '六安'}, {d: '六盘水'}, {d: '柳州'}, {d: '溧阳'}, {d: '龙嘉'}, {d: '龙岩'}, {d: '龙游'}, {d: '娄底'}, {d: '漯河'}, {d: '洛阳'}, {d: '罗源'}, {d: '庐山'}, {d: '吕梁'}], M: [{d: '马鞍山'}, {d: '满洲里'}, {d: '美兰'}, {d: '梅州'}, {d: '绵阳'}, {d: '汨罗'}, {d: '漠河'}, {d: '牡丹江'}]},
        'N-S': {N: [{d: '内江'}, {d: '南昌'}, {d: '南城'}, {d: '南充'}, {d: '南丰'}, {d: '南京'}, {d: '南宁'}, {d: '南通'}, {d: '南阳'}, {d: '宁波'}, {d: '宁德'}, {d: '宁海'}], P: [{d: '盘锦'}, {d: '攀枝花'}, {d: '平顶山'}, {d: '萍乡'}, {d: '平遥'}, {d: '莆田'}], Q: [{d: '迁安'}, {d: '黔江'}, {d: '潜江'}, {d: '蕲春'}, {d: '青城山'}, {d: '青岛'}, {d: '清远'}, {d: '青州市'}, {d: '秦皇岛'}, {d: '琼海'}, {d: '齐齐哈尔'}, {d: '七台河'}, {d: '泉州'}, {d: '曲阜'}, {d: '曲靖'}, {d: '渠县'}, {d: '衢州'}], R: [{d: '任丘'}, {d: '日照'}, {d: '如皋'}, {d: '瑞安'}, {d: '乳山'}], S: [{d: '三门峡'}, {d: '三门县'}, {d: '三明'}, {d: '三亚'}, {d: '上海'}, {d: '上海虹桥'}, {d: '商丘'}, {d: '上饶'}, {d: '上虞'}, {d: '山海关'}, {d: '汕头'}, {d: '韶关'}, {d: '绍兴'}, {d: '邵阳'}, {d: '绅坊'}, {d: '神木'}, {d: '沈阳'}, {d: '深圳'}, {d: '石家庄'}, {d: '十堰'}, {d: '双鸭山'}, {d: '四平'}, {d: '松江'}, {d: '松原'}, {d: '松滋'}, {d: '绥德'}, {d: '绥芬河'}, {d: '遂宁'}, {d: '随州'}, {d: '苏州'}, {d: '宿州'}]},
        'T-X': {T: [{d: '台安'}, {d: '泰安'}, {d: '太姥山'}, {d: '泰宁'}, {d: '泰山'}, {d: '太原'}, {d: '泰州'}, {d: '台州'}, {d: '塘沽'}, {d: '唐家湾'}, {d: '唐山'}, {d: '滕州'}, {d: '天津'}, {d: '天门'}, {d: '天水'}, {d: '铁岭'}, {d: '桐城'}, {d: '通化'}, {d: '通辽'}, {d: '铜陵'}, {d: '铜仁'}, {d: '桐乡'}, {d: '吐鲁番'}], W: [{d: '瓦房店'}, {d: '万宁'}, {d: '万源'}, {d: '万州'}, {d: '潍坊'}, {d: '威海'}, {d: '渭南'}, {d: '文昌'}, {d: '温岭'}, {d: '温州'}, {d: '卧里屯'}, {d: '武昌'}, {d: '乌海'}, {d: '武汉'}, {d: '芜湖'}, {d: '乌兰浩特'}, {d: '武隆'}, {d: '乌鲁木齐'}, {d: '武清'}, {d: '五台山'}, {d: '武威'}, {d: '无锡'}, {d: '无锡新区'}, {d: '武夷山'}], X: [{d: '厦门'}, {d: '西安'}, {d: '襄阳'}, {d: '咸宁'}, {d: '孝感'}, {d: '霞浦'}, {d: '西昌'}, {d: '锡林浩特'}, {d: '邢台'}, {d: '西宁'}, {d: '新乡'}, {d: '信阳'}, {d: '新余'}, {d: '忻州'}, {d: '许昌'}, {d: '徐州'}]},
        'YZ': {Y: [{d: '亚布力'}, {d: '亚龙湾'}, {d: '延安'}, {d: '盐城'}, {d: '雁荡山'}, {d: '阳泉'}, {d: '扬州'}, {d: '延吉'}, {d: '烟台'}, {d: '宜宾'}, {d: '宜昌'}, {d: '宜春'}, {d: '银川'}, {d: '英德'}, {d: '营口'}, {d: '营山'}, {d: '鹰潭'}, {d: '伊宁'}, {d: '义乌'}, {d: '宜兴'}, {d: '益阳'}, {d: '永嘉'}, {d: '永州'}, {d: '尤溪'}, {d: '乐清'}, {d: '岳阳'}, {d: '余杭'}, {d: '榆林'}, {d: '运城'}, {d: '余姚'}], Z: [{d: '枣阳'}, {d: '枣庄'}, {d: '张家界'}, {d: '张家口'}, {d: '章丘'}, {d: '张掖'}, {d: '漳州'}, {d: '湛江'}, {d: '昭通'}, {d: '正定机场'}, {d: '郑州'}, {d: '镇江'}, {d: '镇远'}, {d: '织金'}, {d: '中山'}, {d: '中卫'}, {d: '钟祥'}, {d: '周口'}, {d: '珠海'}, {d: '诸暨'}, {d: '驻马店'}, {d: '株洲'}, {d: '淄博'}]}
      }
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
  .alpha {
    display: flex;
    padding: 10px;
  }

  .alphal {
    width: 30px;
    min-width: 30px;
    font-size: 20px;
    color: dodgerblue;
  }

  .city {
    cursor: pointer;
    margin-right: 10px;
    color: #333333;
    line-height: 25px;
  }

  .city:hover {
    color: dodgerblue;
  }
</style>
